In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from tqdm.auto import tqdm

import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings('ignore')

from IPython.display import display, HTML

# 表示用の設定を変更します
%matplotlib inline
pd.options.display.max_rows = 100
pd.options.display.max_columns = 100
pd.options.display.width = 130

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
from IPython.display import display_html
from itertools import chain,cycle
def display_side_by_side(*args,titles=cycle([''])):
    html_str=''
    for df,title in zip(args, chain(titles,cycle(['</br>'])) ):
        html_str+='<th style="text-align:center"><td style="vertical-align:top">'
        html_str+=f'<h4>{title}</h4>'
        if isinstance(df, pd.DataFrame): 
            html_str+=df.to_html().replace('table','table style="display:inline"')
        else:
            html_str+=pd.DataFrame(df).to_html().replace('table','table style="display:inline"')
        html_str+='</td></th>'
    display_html(html_str,raw=True)

In [5]:
print("Numpy version: ", np.__version__)
print("Pandas version: ", pd.__version__)

Numpy version:  1.19.5
Pandas version:  1.2.4

# Read csv

In [6]:
product = pd.read_csv("./dataset/productIdMapping.txt", delimiter="\t", names=["product_name", "product_id"])
ratio = pd.read_csv("./dataset/ratio_data.csv",index_col=0)

product.head(1)

  product_name  product_id
0        Snack           0

# Pandas Dataframe() and rename

In [7]:
# Preferred way
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c', 3:'a'},
                   'B': {0: 1, 1: 3, 2: 5, 3:7},
                   'C': {0: 2, 1: 4, 2: 6, 3:9}})

# Not preferred way
# Result in all columns to be object dtype
df2 = pd.DataFrame(np.array([[3,"A",1],[6,"A",0],[7,"B",0]]),columns=['feature1','category1','target'])

df1 = df.rename(columns={'A':'a'})

# df1.columns = df1.columns.str.replace('満足度_','')

display_side_by_side(df, df1, titles=['df', 'df1'])

,A,B,C
0,a,1,2
1,b,3,4
2,c,5,6
3,a,7,9
,a,B,C
0,a,1,2
1,b,3,4
2,c,5,6
3,a,7,9

# .loc and .iloc

In [8]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c', 3:'a'},
                   'B': {0: 1, 1: 3, 2: 5, 3:7},
                   'C': {0: 2, 1: 4, 2: 6, 3:9}})


s1= df.loc[:,"A"]
s2 = df.iloc[:,0]

# # Create column "D" from the column "A" = "a"
s3 = df.loc[df[df["A"] == "a"].index, "D"] = df[df["A"] == "a"]["C"].pct_change(-1)

display_side_by_side(df, s1, s2, s3, titles=['df','s1', 's2', 's3'])

## Numpy stack

Given: [1,2],[3,4]

Output: [[1, 3], [2, 4]] using numpy

In [9]:
x = np.array([1,2])
y = np.array([3,4])

np.stack((x, y), axis=-1)

array([[1, 3],
       [2, 4]])

## Numpy tile

Create: [1,2,1,2] using only [1,2] and numpy tile

In [10]:
np.tile([1,2], 2)

array([1, 2, 1, 2])

## Numpy repeat

Create: [1,1,2,2] using only [1,2] and numpy repeat

In [11]:
np.repeat([1,2], 2)

array([1, 1, 2, 2])

## Pandas date range

Create: ['2016-01-01', '2016-01-02'] using pd.date_range()
Create: ['2016-01-03', '2016-01-10'] using pd.date_range()

In [12]:
pd.date_range("2016-01-01", "2016-01-02", freq="D")

DatetimeIndex(['2016-01-01', '2016-01-02'], dtype='datetime64[ns]', freq='D')

In [13]:
pd.date_range("2016-01-01", "2016-01-11", freq="W")

DatetimeIndex(['2016-01-03', '2016-01-10'], dtype='datetime64[ns]', freq='W-SUN')

# Datetime index

In [6]:
df1 = pd.DataFrame([["2020-01-01","1"]], columns=["date","val"])
df1.date.dtype

df1["date"] = pd.DatetimeIndex(df1["date"])
df1.date.dtype

df1["date"] = pd.to_datetime(df1["date"])
df1.date.dtype


# display_side_by_side(df1, df2, titles=['Before','After'])

dtype('O')

dtype('<M8[ns]')

        date val
0 2020-01-01   1

dtype('<M8[ns]')

        date val
0 2020-01-01   1

# Pandas Melt

In [15]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})


df2 = pd.melt(df, id_vars=['A'], value_vars=['B'])

display_side_by_side(df, df2, titles=['Before','After'])

,A,B,C
0,a,1,2
1,b,3,4
2,c,5,6
,A,variable,value
0,a,B,1
1,b,B,3
2,c,B,5

# Transpose

In [16]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})

display_side_by_side(df, df.transpose(), titles=['Before','After'])

,A,B,C
0,a,1,2
1,b,3,4
2,c,5,6
,0,1,2
A,a,b,c
B,1,3,5
C,2,4,6

# Apply

In [17]:
df = pd.DataFrame({'B': {0: 1, 1: 3, 2: 5, 3:5},
                   'C': {0: 2, 1: 4, 2: 6, 3: 4}})

df

df.apply(lambda x: max(x)-min(x), axis=0)

df.apply(lambda x: max(x)-min(x), axis=1)

df.apply(np.sum, axis=1)



# def pronoun_count(x, type):
#     if type == "fp":
#         lst = [i for i in x if i in ["I", "my", "mine", "we", "our"]]
#     elif type == "tp": 
#         lst = [i for i in x if i in ["they", "it", "there"]]
#     return len(lst)

# total["fp_pronouns_count"] = total["tokens"].apply(lambda x: pronoun_count(x, "fp"))

   B  C
0  1  2
1  3  4
2  5  6
3  5  4

B    4
C    4
dtype: int64

0    1
1    1
2    1
3    1
dtype: int64

0     3
1     7
2    11
3     9
dtype: int64

# Advanced Apply

In [6]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})

df

df.groupby('Animal').apply(np.sum, axis=0)

df.groupby('Animal').apply(lambda x: x.count()/df.shape[0])

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

              Animal  Max Speed
Animal
Falcon  FalconFalcon      750.0
Parrot  ParrotParrot       50.0

        Animal  Max Speed
Animal
Falcon     0.5        0.5
Parrot     0.5        0.5

## Resample (Summarize values)

In [19]:
index = pd.date_range('1/1/2000', periods=5, freq='T')
df = pd.DataFrame(range(5), index=index)

# T=Minutes, S=Seconds, D="day"
df1 = df.resample('D').sum()

df2 = df.resample('3T').sum()

display_side_by_side(df, df1, df2, titles=['df','df1','df2'])

,0
2000-01-01 00:00:00,0
2000-01-01 00:01:00,1
2000-01-01 00:02:00,2
2000-01-01 00:03:00,3
2000-01-01 00:04:00,4
,0
2000-01-01,10
,0
2000-01-01 00:00:00,3
2000-01-01 00:03:00,7

## Resample (Increase values)

In [20]:
df1 = pd.DataFrame([1, 2], index=pd.period_range('2018-01-01', freq='d', periods=2), columns=["value"])
df2 = pd.DataFrame([1, 2], index=pd.period_range('2018-01-08', freq='d', periods=2), columns=["value"])

df = pd.concat([df1,df2], axis=0)

df1 = df.resample('D', convention='start').asfreq()

df2 = df1.fillna(method='ffill')


display_side_by_side(df, df1, df2, titles=['df','df1','df2'])

,value
2018-01-01,1
2018-01-02,2
2018-01-08,1
2018-01-09,2
,value
2018-01-01,1.0
2018-01-02,2.0
2018-01-03,NaN
2018-01-04,NaN
2018-01-05,NaN
2018-01-06,NaN
2018-01-07,NaN
2018-01-08,1.0
2018-01-09,2.0
,value
2018-01-01,1.0
2018-01-02,2.0
2018-01-03,2.0
2018-01-04,2.0
2018-01-05,2.0
2018-01-06,2.0
2018-01-07,2.0
2018-01-08,1.0
2018-01-09,2.0

## Drop

In [21]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

df1 = df.dropna(axis=1)

df2 = df.dropna(axis=0)

display_side_by_side(df, df1, df2, titles=['df','df1','df2'])

## Advanced drop

In [28]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

# Drop the row with na value in the column "toy"
# df1 = df[df['toy'].notna()]
df1 = df.dropna(subset=["toy"])

# Drop only if ALL columns are NaN
df2 = df.dropna(how='all')

# Drop the row with more or equal to two NaN values in its columns
df3 = df.dropna(thresh=2)

# Drop by index
df4 = df.drop(df[df["toy"]=="Batmobile"].index)


display_side_by_side(df, df1, df2, df3, titles=['df','df1','df2', 'df3'])

display_side_by_side(df4, titles=['df4'])

,name,toy,born
0,Alfred,NaN,NaT
1,Batman,Batmobile,1940-04-25
2,Catwoman,Bullwhip,NaT
,name,toy,born
1,Batman,Batmobile,1940-04-25
2,Catwoman,Bullwhip,NaT
,name,toy,born
0,Alfred,NaN,NaT
1,Batman,Batmobile,1940-04-25
2,Catwoman,Bullwhip,NaT
,name,toy,born
1,Batman,Batmobile,1940-04-25
2,Catwoman,Bullwhip,NaT

,name,toy,born
0,Alfred,NaN,NaT
2,Catwoman,Bullwhip,NaT

## Advanced columns drop

In [23]:
df = pd.DataFrame({"name_1": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

# Select columns with "object" type
obj_columns = df.select_dtypes(['object']).columns.values

na_cols = [col for col in obj_columns if '_1' in col or '_2' in col]

df1 = df.drop(na_cols, axis=1)

obj_columns
na_cols
df1

array(['name_1', 'toy'], dtype=object)

['name_1']

         toy       born
0        NaN        NaT
1  Batmobile 1940-04-25
2   Bullwhip        NaT

## Group by and value counts

In [24]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]

# Build multi-index from arrays
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))

df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
                  index=index)

df1 = df.groupby('Animal').mean()

df2 = df.groupby('Animal').transform('mean')

display_side_by_side(df, df1, df2, titles=['df','df1','df2'])


# real_rating.value_counts()

## Merge

In [25]:
df1 = pd.DataFrame({'lkey': [0, 1, 2],
                    'fruit' : ['apple', 'banana', 'banana'],
                    'value': [1, 2, 3]})
df2 = pd.DataFrame({'rkey': [0, 0, 2],
                    'fruit' : ['apple', 'banana', 'banana'],
                    'value': [5, 6, 7]})

merged1 = pd.merge(df1, df2, how='left', left_on=['lkey'], right_on=['rkey'])

merged2 = pd.merge(df1, df2, how='left', left_on=['lkey', 'fruit'], right_on=['rkey', 'fruit'])

merged3 = df1.merge(df2, how="inner", on="fruit")

display_side_by_side(df1, df2, merged1, merged2, titles=['df1','df2','merged1', 'merged2'])

display_side_by_side(merged3, titles=['merged3'])

,lkey,fruit,value_x,rkey,value_y
0,0,apple,1,0,5
1,1,banana,2,0,6
2,1,banana,2,2,7
3,2,banana,3,0,6
4,2,banana,3,2,7

# Contains

# Sort

In [26]:
df1 = pd.DataFrame({'lkey': [0, 1, 2],
                    'fruit' : ['apple', 'banana', 'banana'],
                    'value': [1, 2, 3]})

df2 = df1.sort_values(by="value", ascending=False)


display_side_by_side(df1, df2, titles=['df1','df2'])

,lkey,fruit,value
0,0,apple,1
1,1,banana,2
2,2,banana,3
,lkey,fruit,value
2,2,banana,3
1,1,banana,2
0,0,apple,1

# Filter

In [27]:
total_real = total[total["label"]==1]


total_real[total_real["num_words"] < 1000]["num_words"]

NameError: name 'total' is not defined

# Set and reset index

In [ ]:
df1 = pd.DataFrame({'lkey': [0, 1, 2], 'value': [1, 2, 3]}, index=['apple', 'banana', 'banana'])

# date_count.set_index("date", drop=True, inplace=True)

df2 = df1.reset_index()

# df1
df2

# display_side_by_side(df1, df2, titles=['df1','df2'])

# Fillna

# Duplicated and unique values

In [ ]:
df = pd.DataFrame({'user_name': {0: 'a', 1: 'b', 2: 'c', 3:'a'},
                   'B': {0: 1, 1: 3, 2: 5, 3:7},
                   'C': {0: 2, 1: 4, 2: 6, 3:9}})

s1 = df["user_name"].duplicated()
s2 = df["user_name"].duplicated().sum()
print("s2",s2)
s3 = df["user_name"].unique()
s4 = df["user_name"].nunique()
print('s4',s4)

display_side_by_side(df, s1, s3, titles=['df','s1', 's3'])

# replace

In [ ]:
# 例1：
# r'\%'のところはpythonの正規化
df['a'] = df['a'].str.replace(r'%', '')

# 例2：
#　2020年1月1日を 2020/1/1　に変えたいとき
df['date'] = df['date'].str.replace(r'[年,月]', '/')
df['date'] = df['date'].str.replace(r'[日]', '')

#df全体でreplace
df = df.replace(['old value'],'new value')